#P A N D S PRACTICE

In [1]:
import numpy as np
import pandas as pd

In [2]:
#creating a DataFrame
df=pd.DataFrame({
    'Name': ['Naveen', 'Shreya', 'Varsha', 'Varun'],
    'Phone Number': ['111', '222', '333', '444'],
    'Address': ['123, MG Road, Bangalore', '456, Brigade Road, Chennai', '789, Rajaji Nagar, Mumbai', '101, Indira Nagar, Delhi'],
    'Blood Group': ['A+', 'B-', 'O+', 'AB+']
    
    })

In [3]:
df

     Name Phone Number                     Address Blood Group
0  Naveen          111     123, MG Road, Bangalore          A+
1  Shreya          222  456, Brigade Road, Chennai          B-
2  Varsha          333   789, Rajaji Nagar, Mumbai          O+
3   Varun          444    101, Indira Nagar, Delhi         AB+

In [4]:
df= pd.read_csv("D:\VS Code-MACHINE LEARNING\Pandas\Data.csv")

<>:1: SyntaxWarning: invalid escape sequence '\V'
<>:1: SyntaxWarning: invalid escape sequence '\V'
C:\Users\admin\AppData\Local\Temp\ipykernel_17224\2441153047.py:1: SyntaxWarning: invalid escape sequence '\V'
  df= pd.read_csv("D:\VS Code-MACHINE LEARNING\Pandas\Data.csv")

In [5]:
print(df)

   name            email                             phone
0  John Doe        johndoe@example.com        123-456-7890
1  Jane Smith      janesmith@example.com      987-654-3210
2  Alice Johnson   alicejohnson@example.com   555-123-4567
3  John Doe        johndoe@example.com        123-456-7890
4  Jane Smith      janesmith@example.com      987-654-3210
5  Alice Johnson   alicejohnson@example.com   555-123-4567
6  John Doe        johndoe@example.com        123-456-7890
7  Jane Smith      janesmith@example.com      987-654-3210
8  Alice Johnson   alicejohnson@example.com   555-123-4567

In [6]:
df.head() #display the first 5 rows

   name            email                             phone
0  John Doe        johndoe@example.com        123-456-7890
1  Jane Smith      janesmith@example.com      987-654-3210
2  Alice Johnson   alicejohnson@example.com   555-123-4567
3  John Doe        johndoe@example.com        123-456-7890
4  Jane Smith      janesmith@example.com      987-654-3210

In [7]:
df.tail() #display the last 5 rows

   name            email                             phone
4  Jane Smith      janesmith@example.com      987-654-3210
5  Alice Johnson   alicejohnson@example.com   555-123-4567
6  John Doe        johndoe@example.com        123-456-7890
7  Jane Smith      janesmith@example.com      987-654-3210
8  Alice Johnson   alicejohnson@example.com   555-123-4567

In [8]:
df.dtypes

name                         object
 email                       object
 phone                       object
dtype: object

In [9]:
df.columns

Index(['name         ', ' email                   ', ' phone'], dtype='object')

In [10]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [11]:
df.shape

(9, 3)

DATA MANIPULATION :

In [12]:
import pandas as pd
 
# creating a list
values= [['Mohan',455],['Elvish',250],['Deepak',495],
         ['Soni',400],['Radhika',350],['Vansh',450]] 

# creating a pandas dataframe
df = pd.DataFrame(values,columns=['Name','Total_Marks'])

# Applying lambda function to find 
# percentage of 'Total_Marks' column 
# using df.assign()
df = df.assign(Percentage = lambda x: (x['Total_Marks'] /500 * 100))

# displaying the data frame 
df

      Name  Total_Marks  Percentage
0    Mohan          455        91.0
1   Elvish          250        50.0
2   Deepak          495        99.0
3     Soni          400        80.0
4  Radhika          350        70.0
5    Vansh          450        90.0

# RENAME THE COLUMN NAME:

In [13]:
df.rename(columns={"Total_Marks":"marks"})

      Name  marks  Percentage
0    Mohan    455        91.0
1   Elvish    250        50.0
2   Deepak    495        99.0
3     Soni    400        80.0
4  Radhika    350        70.0
5    Vansh    450        90.0

# INDEXING AND SLICING

In [14]:
# Indexing by position
s= pd.Series([1,2,4,7,8,9])
print(s.iloc[-1]) 
print(s.iloc[0])

9
1

In [15]:
# Indexing by label
print(s.loc[0])
print(s.loc[5])

1
9

In [16]:
# Create a Series
s = pd.Series([10, 20, 30, 40], index=['a', 'b', 'c', 'd'])
print(s)

print(s.iloc[0])  # Access the first element
print(s.iloc[1:3])  # Access elements at positions 1 and 2 (exclusive of 3)

# Accessing elements using loc
print(s.loc['a'])  # Access the element with index label 'a'
print(s.loc['b':'c'])  # Access elements with index labels 'b' and 'c'

a    10
b    20
c    30
d    40
dtype: int64
10
b    20
c    30
dtype: int64
10
b    20
c    30
dtype: int64

In [17]:
# Filtering elements greater than 5
filtered = s[s > 39]
print(filtered)

d    40
dtype: int64

In [18]:
#AGGREGATION

p=pd.Series([1,2,7,5,8,9,4])
print(p.sum())

36

In [19]:
print(p)
print(p.cumsum())

0    1
1    2
2    7
3    5
4    8
5    9
6    4
dtype: int64
0     1
1     3
2    10
3    15
4    23
5    32
6    36
dtype: int64

In [20]:
a=p.aggregate(['sum','mean','product','std'])
print(a)

sum           36.000000
mean           5.142857
product    20160.000000
std            3.023716
dtype: float64

In [21]:
#DATA WRANGLING


df1=pd.DataFrame(
    {
        "EMP_ID"  :[207,202,203,204,205],
        
        "EMP_NAME": ["MOHAN","RAMU","SOMU","CHITTI","PRAVEEN"]
        
    }
)

In [22]:
df1

   EMP_ID EMP_NAME
0     207    MOHAN
1     202     RAMU
2     203     SOMU
3     204   CHITTI
4     205  PRAVEEN

In [23]:
df2=pd.DataFrame(
    {
        "EMP_ID":[202,201,207,202],
        "EMP_NAME":["MOHAN","TEJA","RAMU","PHANI"]
    }
)

In [24]:
df2

   EMP_ID EMP_NAME
0     202    MOHAN
1     201     TEJA
2     207     RAMU
3     202    PHANI

In [25]:
#MERGE THE 2 DATA FRAMES
pd.merge(df1,df2,on="EMP_ID")

   EMP_ID EMP_NAME_x EMP_NAME_y
0     207      MOHAN       RAMU
1     202       RAMU      MOHAN
2     202       RAMU      PHANI

In [26]:
#GROUPING

GRP=df1.groupby("EMP_NAME")
GRP.get_group("RAMU")

   EMP_ID EMP_NAME
1     202     RAMU

In [27]:
#CONCATENATION 
pd.concat([df1,df2])

   EMP_ID EMP_NAME
0     207    MOHAN
1     202     RAMU
2     203     SOMU
3     204   CHITTI
4     205  PRAVEEN
0     202    MOHAN
1     201     TEJA
2     207     RAMU
3     202    PHANI

In [28]:
#df1.describe()

In [29]:
#ADD THE OWN INDEX VALUES
pd.Series([1,2,3,4,5],index=["a","b","c","d","e"])

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [30]:
import matplotlib.pyplot as plt

In [31]:
import sklearn

In [32]:
import seaborn as sns

In [33]:
import matplotlib.pyplot as plt